# BuiltInFailures.UniqueElementFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..UniqueElementFailures Class
BuiltInFailures Class Members See Also
---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class UniqueElementFailures
```

Visual Basic
---
```text
Public NotInheritable Class UniqueElementFailures
```

Visual C++
---
```text
public ref class UniqueElementFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..UniqueElementFailures
# See Also
BuiltInFailures..::..UniqueElementFailures Members
Autodesk.Revit.DB Namespace